In [2]:
import pandas as pd

In [1]:
data={"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "sex":["M","M","M","M","F","F","F"]}

In [3]:
# Create a dataframe
df = pd.DataFrame(data)

In [4]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [7]:
# Change the order of the columns
df = pd.DataFrame(data, columns = ['name', 'sport', 'sex', 'score'])
df

      name      sport sex  score
0     Bill  Wrestling   M     90
1      Tom   Football   M     80
2      Tim     Skiing   M     85
3     John   Swimming   M     75
4     Alex     Tennis   F     95
5  Vanessa     Karete   F     60
6     Kate    Surfing   F     65

In [11]:
df['name']

0       Bill
1        Tom
2        Tim
3       John
4       Alex
5    Vanessa
6       Kate
Name: name, dtype: object

In [12]:
# Access John
df.loc[3, 'name']

'John'

In [13]:
# Accessing a row
df.loc[3]

name         John
sport    Swimming
sex             M
score          75
Name: 3, dtype: object